/*
 * =====================================================================================
 *
 *    Description:  배열 이름의 포인터 연산
 *
 *       Compiler:  gcc
 *
 *         Author:  Jaeyun Choe 
 *
 * =====================================================================================
 */

#include <stdio.h>

int main(void) {
	int arr1[3] = {1, 2, 3};
	double arr2[3] = {0.1, 0.2, 0.3};

	printf("arr1 : %d, arr2 : %g \n", *arr1, *arr2);
	
	*arr1 += 10; // 포인터 연산
	*arr2 += 3.04; // 포인터 연산 
	
	printf("arr1 : %d, arr2 : %g \n", *arr1, *arr2);
	
	return 0;
}
